<a href="https://colab.research.google.com/github/Jauny143/Pandas/blob/main/Pandas_exercise1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

**Check the version of pandas**

In [2]:
print(pd.__version__)

1.1.5

**Create a series from a list**

In [3]:

lst = list('abcdefghijklmnopqrstuvwxyz')
pd.Series(lst).head()

0    a
1    b
2    c
3    d
4    e
dtype: object

**Create a series from a numpy array**

In [4]:
import numpy as np
arr = np.arange(9)
pd.Series(arr)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

**Create a series from a dictionary**

In [6]:
pd.Series(dict(zip(lst,range(25)))).head()

a    0
b    1
c    2
d    3
e    4
dtype: int64

**Convert the index of a series into a column of a dataframe**

In [13]:
x= pd.Series(lst)
x.to_frame().reset_index().head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  d
4      4  e

**Combine many series to form a dataframe**

In [19]:
ser1 = pd.Series(list('abcdefghij'))
ser2 = pd.Series(range(10))
#sol:1
df = pd.concat([ser1,ser2],axis=1)
#sol:2 
pd.DataFrame({'col1':ser1, 'col2':ser2}).head()

  col1  col2
0    a     0
1    b     1
2    c     2
3    d     3
4    e     4

In [16]:
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  d  3
4  e  4

**Assign name to the series index**

In [24]:
fam = pd.Series(['Shri Satya Beer','Smt Sona','Mukesh','Ravindra','Jauny','Sweta','Monika','Veer','Kush','Dhruv'])
fam.name='Family'
fam

0    Shri Satya Beer
1           Smt Sona
2             Mukesh
3           Ravindra
4              Jauny
5              Sweta
6             Monika
7               Veer
8               Kush
9              Dhruv
Name: Family, dtype: object

**Get the items of series A not present in series B**

In [26]:
ser1 = pd.Series([1,2,3,4,5,6,7])
ser2 = pd.Series([5,6,7,8,9,0,10])

ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
3    4
dtype: int64

**Get the items not common to both series A and series B**

In [30]:
A = pd.Series([1,2,3,4,5,6,7,8,9])
B = pd.Series([10,11,12,13,14,4,6,9])
A_uni_B = pd.Series(np.union1d(A,B)) #union of A and B
A_int_B = pd.Series(np.intersect1d(A,B)) #intersection of A and B
A_uni_B[~A_uni_B.isin(A_int_B)]

0      1
1      2
2      3
4      5
6      7
7      8
9     10
10    11
11    12
12    13
13    14
dtype: int64

**Get the minimum, 25th percentile, median, 75th, and max of a numeric series**

In [39]:
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))
ser1 = pd.Series([1,2,3,5,6,7])
np.percentile(ser1,q=[0, 25, 50,75,100])

array([1.  , 2.25, 4.  , 5.75, 7.  ])